---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
source: html/21ce2f4a-04fd-dbe1-6d16-f9f69ba113d5.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius

A constraint which can be applied to a RebarShapeSegment, and causes the segment
 to be replaced with a 180-degree arc. The associated parameter drives
 the radius of the arc.

## Syntax (C#)
```csharp
public class RebarShapeConstraint180DegreeBendRadius : RebarShapeConstraint
```